#!/bin/bash
# Разбивка одного из исходных файлов на меньшие с разным размером и разным mtime
zcat 20170929000000.tsv.gz | head -n 422995 > ./20170929000010.tsv
sleep 70
zcat 20170929000000.tsv.gz | head -n 500000| tail -n 77005 > ./20170929000020.tsv
sleep 70
zcat 20170929000000.tsv.gz | head -n 1000000| tail -n 500000 > ./20170929000030.tsv
sleep 70
zcat 20170929000000.tsv.gz | tail -n 500000 > ./20170929000050.tsv
sleep 70
zcat 20170929000000.tsv.gz | head -n 2000000| tail -n 1000000 > ./20170929000040.tsv